[
    {
        "title": "Speckled Egg Cake",
        "img": "https://i.ibb.co/8s50nXb/cake-1.jpg",
        "description": "It might not feel like it, with cold air and snow still hanging around, but Spring is just around the corner. Before you know it, the first buds of green will be popping up on tree branches. Birds will be chirping. Flowers will be blooming. And Easter will be on the way!  So today we are getting ready with a new cake tutorial that is all about Spring!  Inspired by the gorgeous color and texture of robins eggs, this cake is super easy and incredibly fun.  And completely achievable for all levels of bakers, to include your favorite little egg-hunters. It is a Speckled Easter Egg Cake tutorial and I hope you enjoy it! Before we get started on the very scientific speckling technique, lets talk about the cake itself. I used a Classic Vanilla Cake recipe and baked it as four layers. You can bake your cakes several days in advance and either freeze them or keep them in the refrigerator.  Being a mom to a little one means my windows of time are quite short.  So on Day #1, I baked the cake and made the eggs. Day #2, I made a batch of basic buttercream icing (recipe here). Day #3, I assembled and decorated the cake. You, by no means, have to follow my extra prolonged, toddler-approved schedule. But if needed, you can certainly spread this project out over several days. Now, lets talk about the eggs! There are several ways you could go about making these eggs. You can use an egg-shaped candy mold to create white chocolate eggs, colored appropriately. You can use real eggs that are hard boiled (or blown out) and then dyed. {Please do not use raw eggs… that is just asking for trouble.} You can shape eggs out of fondant or gumpaste. Or you can simply purchase any speckled candy eggs that you like. Whichever route you pick, this is your first step in decorating. Your overall color scheme starts with your eggs!"
    },
    {
        "title": "Blackberry Lime Cake",
        "img": "https://i.ibb.co/ZGNK40J/cake-2.jpg",
        "description": "Spring is officially here. While our local weather has been up, down and everywhere in between, my heart is ready for birds chirping, green buds of new growth on the trees and blooms of color. Mother Nature might be slow to cooperate, but this is the time of year to embrace color, in all of its pastel glory. From Easter and Mothers Day to baby and bridal showers, theres ample opportunity to dive straight into the lush florals and gorgeous hues that springtime has to offer. And todays Blackberry Lime Cake does not disappoint. This is cake is a celebration of everything spring.  Shades of violet sing as sweetened blackberries meet up with subtle notes of lime, created only with natures best. Not only are we decorating with gorgeous edible flowers but we are tinting the frosting with the pigments naturally found in fresh blackberries. The result is a subtle lavender hue that looks like it came from a bottle but really came from the earths bounty. Fresh blackberries are somewhat underutilized in cake baking, probably because of their large size and high water content. If you take a pack of fresh blackberries and toss them into a silky buttercream frosting, you will end up with a sad soupy mess. Add fresh berries to a cake batter and they all sink straight to the bottom. So we are taking fresh berries and reducing them down, I am talking way down, past the jam or jelly stage to really concentrate the flavor. The result is almost like a paste once it sets up. When mixed into our frosting, it clumps ever so slightly, giving a beautiful speckle to the finished cake, which closely resembles bits of broken berry."
    },
    {
        "title": "Marbled Chocolate Easter Eggs",
        "img": "https://i.ibb.co/GnWG81Q/cake-3.jpg",
        "description": "These marbled chocolate Easter eggs are a fun, easy, and delicious way to dress up a cake or cupcakes for your holiday brunch table. They look so impressive, but are way easier and faster to make than they appear. Do not worry about having a steady piping hand! Anything wonky or wobbly will be smoothed over in the marbling process. Create a similar look suited for any spring celebration by swapping the egg-shaped cutters for circles or flowers. Use my heating pad trick to keep the chocolate fluid and frustration to a minimum. Plug in the heating pad (if using) and turn it up to high heat. Cover the pad with a piece of paper towel. Top the paper towel with a sheet of foil. Melt various colors of coating chocolate in heatproof bowls according to the package directions. I used pink, blue, white, green, and yellow, but you can use whatever colors you like. Fill piping bags or paper cones with each color. Store the piping bags under the foil on the heating pad to keep the chocolate fluid while you work. Use a pencil to trace the outline of egg-shaped cookie cutters on a piece of parchment paper. Cut the paper into little squares with an outline on each square. Flip one of the egg templates over onto a tray or cutting board. Fill in the outline of the egg with one of the coating chocolate colors."
    },
    {
        "title": "Easter Bunny Cupcakes",
        "img": "https://i.ibb.co/8zRQGb0/cake-4.jpg",
        "description": "With Easter just a hop, skip, and a jump away, I decided it was time to work my magic at updating a classic - bunny ear cupcakes! I have seen fondant ears, marshmallow ears, and piped chocolate ears, but never smeared ears like we have right here. (Sorry, could not help myself.) If you have been following along with my chocolate adventures for any length of time, then you have seen me use this technique to make all kinds of chocolate flower petals. Lucky for us, it also makes the perfect set of edible and delicious bunny ears! Also lucky, it is easy to whip up a ton of these in a flash well in advance of the big day. Whether you make them with coating chocolate or the real deal, they can be stored in an airtight container at room temperature for weeks at a time. I decided to go the extra mile and give my little bunnies buttercream floral headbands, but that is 100% optional. Use the ears on their own or pop on a few ready-made icing flowers from the craft store. Dip the flat side of the larger knife in the melted chocolate. Scrape the back and sides of the knife clean against the lip of the bowl. Hold the coated side of the knife about 2 inches up from the edge of the paper. Gently press the melted chocolate onto the paper, pulling the knife down and away. Melt the pink coating chocolate in a small heatproof bowl following the package instructions. Dip the flat side of the smaller knife in the melted chocolate. Wipe the back and sides clean against the lip of the bowl. Smear the pink chocolate, just as you did with the white, down the middle of one of the white ear backs, making sure to leave a perimeter of white around the pink middle."
    }
]